Tekla Open API Reference for Tekla Structures 2025
DisposableToken Constructor
 Initializes a new instance of the DisposableToken class.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DisposableToken(
	Action disposed
)
Public Sub New (
	disposed As Action
)
Parameters
disposed
Type: System.Action
The delegate to a method that is invoked on dispose.
See Also
Reference
DisposableToken Class
Tekla.Structures.Model Namespace